export const state = () => ({
  news: [

    {
      id: '2',
      img: 'https://kod.ru/content/images/size/w450/2021/04/maxresdefault-1.jpg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'В Discord добавили Stage Channels – аналог Clubhouse',
      author: 'Nodir Navruzov',
      date: 'Apr 04, 2021 • 12:20'
    },
    {
      id: '3',
      img: 'https://kod.ru/content/images/size/w450/2021/04/1598450048_0_265_3072_1993_1920x0_80_0_0_be4114af8b256003932d212ff6b53d33.jpg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'В сеть утекли личные данные 533 млн пользователей Facebook',
      author: 'Гор Хачатрян',
      date: 'Apr 04, 2021 • 16:34'
    },
    {
      id: '4',
      img: 'https://kod.ru/content/images/size/w450/2021/04/Ex7xMplVcAQlQiF_large.jpeg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'Microsoft выпустит холодильник в форме консоли Xbox Series X',
      author: 'Гор Хачатрян',
      date: 'Apr 03, 2021 • 10:00'
    },
    {
      id: '5',
      img: 'https://kod.ru/content/images/size/w1450/2021/04/marsianskij-vertolet.jpg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'Вертолёт Ingenuity выгружен на поверхность Марса и готовится к своему первому полёту',
      author: 'Nodir Navruzov',
      date: 'Apr 04, 2021 • 11:35'
    },
    {
      id: '6',
      img: 'https://kod.ru/content/images/size/w450/2021/04/7-1.jpg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'Предустановленные российские приложения уличили в отправке данных пользователей за рубеж',
      author: 'Гор Хачатрян',
      date: 'Apr 04, 2021 • 09:08'
    }
  ],
  articles: [
    {
      id: 10,
      title: 'Больше счетов - больше убытков, или как Райффайзенбанк может вас разорить из-за ошибки в ИТ-системе',
      category: 'Finance',
      author: 'Yaroslav Dubovikov',
      date: '21 минут назад.',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      text: `
      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот представьте ситуацию: вы открываете приложение, а у вас на КАЖДОМ счету минус. Причем минус одна и та же сумма. Сначала думаешь, что какая-то ошибка. Но нет, Райффайзенбанк думает иначе.
      Причем о принудительных списаниях банка вы не узнаете ни в смс, ни в push-уведомлении. А только при попытке оплатить картой на кассе за покупки.
Простая ситуация - ФССП взыскал сумму штрафа, о котором не было заранее известно надлежащим образом (первое взыскание за 10 лет - и те самые бредовые штрафы Собянина за нарушение режима самоизоляции - процедура обжалования уже запущена, но не завершена). При постановлении был ошибочно указан адрес и некоторые данные нарушителя. Но это не помешало ФССП приступить к процедуре взыскания. Это вопрос другой, его можно будет рассмотреть отдельно. Сумма небольшая (в размере 6000 рублей), но все же.

Оказалось, что Райффайзенбанк позволяет себе не уведомлять вас о проводимой операции как того требует закон о НПС. То есть вы совершили действие (изменился показатель вашего банковского счета) - банк прислал уведомление. Райффайзенбанк по телефону доблестно сообщил, что о «таких мелких операциях они не уведомляют». «Мелкая операция». Правда?
      `,

    },

    {
      id: 20,
      title: 'Microsoft начала топить серверы в жидкости для охлаждения и повышения их производительности ',
      category: 'Finance',
      author: 'Евгения Евсеева',
      date: '2 часа назад.',
      descr: ' Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот     Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      text: `
      Microsoft начнёт погружать серверы в специальную жидкость, чтобы повысить их производительность, пишет The Verge. Процесс погружного охлаждения существует уже несколько лет, но компания заявляет, что она «первый поставщик облачных услуг» который использует такое охлаждение в производстве.

При таком охлаждении серверные стойки погружают в специальную жидкость на основе фторуглерода, безвредную для электроники. Она отводит тепло от серверных компонентов, достигает точки кипения, конденсируется, а затем снова попадает на сервера. Это создает замкнутую систему охлаждения.
Такой способ охлаждения в последние несколько лет используют во время майнинга биткоина и других криптовалют, пишет The Verge. Сейчас большинство центров обработки данных охлаждают серверы, понижая температуру воздуха с помощью испарения воды, но он требует большого расхода жидкости.

В Microsoft надеются, что так смогут не использовать воду в центрах обработки данных. Также это позволит компании более компактно располагать серверы, что сократит пространство, выделенное под них. Сейчас компания проводит тесты только с одной стойкой, но в будущем планирует расширить эксперимент.
`
    },

    {
      id: 30,
      title: 'Вышел на раннюю пенсию, но после всё пошло не по плану. История автора зарубежного блога Living A FI ',
      category: 'Finance',
      author: 'Максим Ильин',
      date: '6 часов назад.',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      text: `Речь о зарубежном блоге Living A FI. Автор блога писал намного реже своих коллег, и никогда не размещал у себя никакой рекламы или рекомендаций каких-либо продуктов и услуг. Просто хорошие и подробные мысли о финансовой независимости и жизни.

      В своем посте он поведал читателям о 6-ти годах своей жизни, которые включают самый счастливый его год, худший год, проблемы со здоровьем, развод, возвращение к работе и движение вперед.
      
      Это интересный, отрезвляющий и достаточно длинный пост, в котором автор поделился с читателями своими проблемами, которые настигли его после выхода на раннюю пенсию.
      
      Я постарался максимально сжать этот пост и оставить только главное, но текст всё-равно получился достаточно длинный. Мне пришлось разбить его на 3 части, чтобы было не так утомительно читать. Оригинал поста здесь, перевод ниже.
      
      Перевод поста с блога Living A FI
      Мне было трудно найти возможность сделать новую запись в блоге, который я забросил в 2015 году. Но всё это время меня не покидало чувство, что я должен поделиться с читателями новостями о своей текущей жизни. Считайте это попыткой объединить последние шесть лет моей жизни в один пост.
`
    },
    {
      id: 40,
      title: 'Вышел на раннюю пенсию, но после всё пошло не по плану. История автора зарубежного блога Living A FI ',
      category: 'Finance',
      author: 'Максим Ильин',
      date: 'Apr 05, 2021 • 14:20',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      text: `Речь о зарубежном блоге Living A FI. Автор блога писал намного реже своих коллег, и никогда не размещал у себя никакой рекламы или рекомендаций каких-либо продуктов и услуг. Просто хорошие и подробные мысли о финансовой независимости и жизни.

      В своем посте он поведал читателям о 6-ти годах своей жизни, которые включают самый счастливый его год, худший год, проблемы со здоровьем, развод, возвращение к работе и движение вперед.
      
      Это интересный, отрезвляющий и достаточно длинный пост, в котором автор поделился с читателями своими проблемами, которые настигли его после выхода на раннюю пенсию.
      
      Я постарался максимально сжать этот пост и оставить только главное, но текст всё-равно получился достаточно длинный. Мне пришлось разбить его на 3 части, чтобы было не так утомительно читать. Оригинал поста здесь, перевод ниже.
      
      Перевод поста с блога Living A FI
      Мне было трудно найти возможность сделать новую запись в блоге, который я забросил в 2015 году. Но всё это время меня не покидало чувство, что я должен поделиться с читателями новостями о своей текущей жизни. Считайте это попыткой объединить последние шесть лет моей жизни в один пост.
`
    },
    {
      id: 50,
      title: 'Вышел на раннюю пенсию, но после всё пошло не по плану. История автора зарубежного блога Living A FI ',
      category: 'Finance',
      author: 'Максим Ильин',
      date: 'Apr 05, 2021 • 14:20',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      text: `Речь о зарубежном блоге Living A FI. Автор блога писал намного реже своих коллег, и никогда не размещал у себя никакой рекламы или рекомендаций каких-либо продуктов и услуг. Просто хорошие и подробные мысли о финансовой независимости и жизни.

      В своем посте он поведал читателям о 6-ти годах своей жизни, которые включают самый счастливый его год, худший год, проблемы со здоровьем, развод, возвращение к работе и движение вперед.
      
      Это интересный, отрезвляющий и достаточно длинный пост, в котором автор поделился с читателями своими проблемами, которые настигли его после выхода на раннюю пенсию.
      
      Я постарался максимально сжать этот пост и оставить только главное, но текст всё-равно получился достаточно длинный. Мне пришлось разбить его на 3 части, чтобы было не так утомительно читать. Оригинал поста здесь, перевод ниже.
      
      Перевод поста с блога Living A FI
      Мне было трудно найти возможность сделать новую запись в блоге, который я забросил в 2015 году. Но всё это время меня не покидало чувство, что я должен поделиться с читателями новостями о своей текущей жизни. Считайте это попыткой объединить последние шесть лет моей жизни в один пост.
`
    },
    {
      id: 60,
      title: 'Вышел на раннюю пенсию, но после всё пошло не по плану. История автора зарубежного блога Living A FI ',
      category: 'Finance',
      author: 'Максим Ильин',
      date: 'Apr 05, 2021 • 14:20',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      text: `Речь о зарубежном блоге Living A FI. Автор блога писал намного реже своих коллег, и никогда не размещал у себя никакой рекламы или рекомендаций каких-либо продуктов и услуг. Просто хорошие и подробные мысли о финансовой независимости и жизни.

      В своем посте он поведал читателям о 6-ти годах своей жизни, которые включают самый счастливый его год, худший год, проблемы со здоровьем, развод, возвращение к работе и движение вперед.
      
      Это интересный, отрезвляющий и достаточно длинный пост, в котором автор поделился с читателями своими проблемами, которые настигли его после выхода на раннюю пенсию.
      
      Я постарался максимально сжать этот пост и оставить только главное, но текст всё-равно получился достаточно длинный. Мне пришлось разбить его на 3 части, чтобы было не так утомительно читать. Оригинал поста здесь, перевод ниже.
      
      Перевод поста с блога Living A FI
      Мне было трудно найти возможность сделать новую запись в блоге, который я забросил в 2015 году. Но всё это время меня не покидало чувство, что я должен поделиться с читателями новостями о своей текущей жизни. Считайте это попыткой объединить последние шесть лет моей жизни в один пост.
`
    },
    {
      id: 70,
      title: 'Вышел на раннюю пенсию, но после всё пошло не по плану. История автора зарубежного блога Living A FI ',
      category: 'Finance',
      author: 'Максим Ильин',
      date: 'Apr 05, 2021 • 14:20',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      text: `Речь о зарубежном блоге Living A FI. Автор блога писал намного реже своих коллег, и никогда не размещал у себя никакой рекламы или рекомендаций каких-либо продуктов и услуг. Просто хорошие и подробные мысли о финансовой независимости и жизни.

      В своем посте он поведал читателям о 6-ти годах своей жизни, которые включают самый счастливый его год, худший год, проблемы со здоровьем, развод, возвращение к работе и движение вперед.
      
      Это интересный, отрезвляющий и достаточно длинный пост, в котором автор поделился с читателями своими проблемами, которые настигли его после выхода на раннюю пенсию.
      
      Я постарался максимально сжать этот пост и оставить только главное, но текст всё-равно получился достаточно длинный. Мне пришлось разбить его на 3 части, чтобы было не так утомительно читать. Оригинал поста здесь, перевод ниже.
      
      Перевод поста с блога Living A FI
      Мне было трудно найти возможность сделать новую запись в блоге, который я забросил в 2015 году. Но всё это время меня не покидало чувство, что я должен поделиться с читателями новостями о своей текущей жизни. Считайте это попыткой объединить последние шесть лет моей жизни в один пост.
`
    },
    {
      id: 80,
      title: 'Вышел на раннюю пенсию, но после всё пошло не по плану. История автора зарубежного блога Living A FI ',
      category: 'Finance',
      author: 'Максим Ильин',
      date: 'Apr 05, 2021 • 14:20',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      text: `Речь о зарубежном блоге Living A FI. Автор блога писал намного реже своих коллег, и никогда не размещал у себя никакой рекламы или рекомендаций каких-либо продуктов и услуг. Просто хорошие и подробные мысли о финансовой независимости и жизни.

     В своем посте он поведал читателям о 6-ти годах своей жизни, которые включают самый счастливый его год, худший год, проблемы со здоровьем, развод, возвращение к работе и движение вперед.
     
     Это интересный, отрезвляющий и достаточно длинный пост, в котором автор поделился с читателями своими проблемами, которые настигли его после выхода на раннюю пенсию.
     
     Я постарался максимально сжать этот пост и оставить только главное, но текст всё-равно получился достаточно длинный. Мне пришлось разбить его на 3 части, чтобы было не так утомительно читать. Оригинал поста здесь, перевод ниже.
     
     Перевод поста с блога Living A FI
     Мне было трудно найти возможность сделать новую запись в блоге, который я забросил в 2015 году. Но всё это время меня не покидало чувство, что я должен поделиться с читателями новостями о своей текущей жизни. Считайте это попыткой объединить последние шесть лет моей жизни в один пост.
`
    },
    {
      id: 90,
      title: 'Вышел на раннюю пенсию, но после всё пошло не по плану. История автора зарубежного блога Living A FI ',
      category: 'Finance',
      author: 'Максим Ильин',
      date: 'Apr 05, 2021 • 14:20',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      text: `Речь о зарубежном блоге Living A FI. Автор блога писал намного реже своих коллег, и никогда не размещал у себя никакой рекламы или рекомендаций каких-либо продуктов и услуг. Просто хорошие и подробные мысли о финансовой независимости и жизни.

     В своем посте он поведал читателям о 6-ти годах своей жизни, которые включают самый счастливый его год, худший год, проблемы со здоровьем, развод, возвращение к работе и движение вперед.
     
     Это интересный, отрезвляющий и достаточно длинный пост, в котором автор поделился с читателями своими проблемами, которые настигли его после выхода на раннюю пенсию.
     
     Я постарался максимально сжать этот пост и оставить только главное, но текст всё-равно получился достаточно длинный. Мне пришлось разбить его на 3 части, чтобы было не так утомительно читать. Оригинал поста здесь, перевод ниже.
     
     Перевод поста с блога Living A FI
     Мне было трудно найти возможность сделать новую запись в блоге, который я забросил в 2015 году. Но всё это время меня не покидало чувство, что я должен поделиться с читателями новостями о своей текущей жизни. Считайте это попыткой объединить последние шесть лет моей жизни в один пост.
`
    },
    {
      id: 100,
      title: 'Вышел на раннюю пенсию, но после всё пошло не по плану. История автора зарубежного блога Living A FI ',
      category: 'Finance',
      author: 'Максим Ильин',
      date: 'Apr 05, 2021 • 14:20',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      text: `Речь о зарубежном блоге Living A FI. Автор блога писал намного реже своих коллег, и никогда не размещал у себя никакой рекламы или рекомендаций каких-либо продуктов и услуг. Просто хорошие и подробные мысли о финансовой независимости и жизни.

     В своем посте он поведал читателям о 6-ти годах своей жизни, которые включают самый счастливый его год, худший год, проблемы со здоровьем, развод, возвращение к работе и движение вперед.
     
     Это интересный, отрезвляющий и достаточно длинный пост, в котором автор поделился с читателями своими проблемами, которые настигли его после выхода на раннюю пенсию.
     
     Я постарался максимально сжать этот пост и оставить только главное, но текст всё-равно получился достаточно длинный. Мне пришлось разбить его на 3 части, чтобы было не так утомительно читать. Оригинал поста здесь, перевод ниже.
     
     Перевод поста с блога Living A FI
     Мне было трудно найти возможность сделать новую запись в блоге, который я забросил в 2015 году. Но всё это время меня не покидало чувство, что я должен поделиться с читателями новостями о своей текущей жизни. Считайте это попыткой объединить последние шесть лет моей жизни в один пост.
`
    }
  ],

  allContent: [

    {
      id: '2',
      img: 'https://kod.ru/content/images/size/w450/2021/04/maxresdefault-1.jpg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'В Discord добавили Stage Channels – аналог Clubhouse',
      author: 'Nodir Navruzov',
      date: 'Apr 04 • 12:20'
    },
    {
      id: '3',
      img: 'https://kod.ru/content/images/size/w450/2021/04/1598450048_0_265_3072_1993_1920x0_80_0_0_be4114af8b256003932d212ff6b53d33.jpg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'В сеть утекли личные данные 533 млн пользователей Facebook',
      author: 'Гор Хачатрян',
      date: 'Apr 04 • 16:34'
    },
    {
      id: '4',
      img: 'https://kod.ru/content/images/size/w450/2021/04/Ex7xMplVcAQlQiF_large.jpeg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'Microsoft выпустит холодильник в форме консоли Xbox Series X',
      author: 'Гор Хачатрян',
      date: 'Apr 03 • 10:00'
    },
    {
      id: '5',
      img: 'https://kod.ru/content/images/size/w1450/2021/04/marsianskij-vertolet.jpg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'Вертолёт Ingenuity выгружен на поверхность Марса и готовится к своему первому полёту',
      author: 'Nodir Navruzov',
      date: 'Apr 04 • 11:35'
    },
    {
      id: '6',
      img: 'https://kod.ru/content/images/size/w450/2021/04/7-1.jpg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'Предустановленные российские приложения уличили в отправке данных пользователей за рубеж',
      author: 'Гор Хачатрян',
      date: 'Apr 04 • 09:08'
    }
  ],
  trend: [

    {
      id: '2',
      img: 'https://kod.ru/content/images/size/w450/2021/04/maxresdefault-1.jpg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'В Discord добавили Stage Channels – аналог Clubhouse',
      author: 'Nodir Navruzov',
      date: 'Apr 04, 2021 • 12:20'
    },
    {
      id: '3',
      img: 'https://kod.ru/content/images/size/w450/2021/04/1598450048_0_265_3072_1993_1920x0_80_0_0_be4114af8b256003932d212ff6b53d33.jpg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'В сеть утекли личные данные 533 млн пользователей Facebook',
      author: 'Гор Хачатрян',
      date: 'Apr 04, 2021 • 16:34'
    },
    {
      id: '4',
      img: 'https://kod.ru/content/images/size/w450/2021/04/Ex7xMplVcAQlQiF_large.jpeg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'Microsoft выпустит холодильник в форме консоли Xbox Series X',
      author: 'Гор Хачатрян',
      date: 'Apr 03, 2021 • 10:00'
    },
    {
      id: '5',
      img: 'https://kod.ru/content/images/size/w450/2021/04/Ex7xMplVcAQlQiF_large.jpeg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'Microsoft выпустит холодильник в форме консоли Xbox Series X',
      author: 'Гор Хачатрян',
      date: 'Apr 03, 2021 • 10:00'
    },
    {
      id: '6',
      img: 'https://kod.ru/content/images/size/w450/2021/04/Ex7xMplVcAQlQiF_large.jpeg',
      category: 'News',
      descr: '      Каждый из нас привык, что у него в мобильном приложении банка есть несколько разделенных счетов: текущий для оплат через банковскую карту, накопительный, резервный и так далее. Таких счетов может быть несколько штук или даже десятков под разные цели и задачи. И вот ',
      title: 'Microsoft выпустит холодильник в форме консоли Xbox Series X',
      author: 'Гор Хачатрян',
      date: 'Apr 03, 2021 • 10:00'
    },
  ]
})

export const mutations = {

}

export const actions = {

}

export const getters = {
  getNews(state) {
    return state.news
  },
  getArticles(state) {
    return state.articles
  },
  getAllContent(state) {
    return state.allContent
  },
  getTrendNews(state) {
    return state.trend
  }
}